W8D1/RedditClone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        if @post.save
---
INSERT INTO "posts" ("title", "context", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Rock"], ["context", "Rock is hard"], ["sub_id", 1], ["author_id", 7], ["created_at", "2020-09-14 23:44:04.210161"], ["updated_at", "2020-09-14 23:44:04.210161"]]