W8D1/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Music"], ["description", "Music is cool"], ["moderator_id", 7], ["created_at", "2020-09-14 21:06:18.861137"], ["updated_at", "2020-09-14 21:06:18.861137"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = params[:user_id]
        if @sub.save