W8D1/RedditClone/app/views/users/show.html.erb

<ul>
    <% @user.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs"

        <br>
            <ul><% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"