W6D5/Cats99/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "color" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "F"], ["color", "Orange"], ["updated_at", "2020-09-04 23:42:41.407342"], ["id", 1]]