W8D1/RedditClone/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]
---
<h3>This sub belongs to <a href="<%= user_url(@sub.moderator) %>"><%= @sub.moderator.username %></a></h3>
    <% @sub.posts.each do |post| %>